In [1]:
import pandas as pd
import numpy as np

In [2]:
#from google.colab import drive
#drive.mount('/content/drive')

#path = '/content/drive/My Drive/B4/'
path = '/home/jovyan/work'

## Country Codes 
Se lee el country_codes.csv

In [3]:
dfcc = pd.read_csv(path + '/country_codes.csv', sep=';')

In [4]:
print(dfcc.shape)
dfcc.head()

(217, 2)

       country iso_code
0  Afghanistan      AFG
1      Albania      ALB
2      Algeria      DZA
3      Andorra      AND
4       Angola      AGO

In [5]:
# Agregamos un "nuevo país" para los que no están especificados: Unspecified USP
dfcc = dfcc.append({'country': 'Unspecified', 'iso_code': 'USP'} , ignore_index=True)

/tmp/ipykernel_112/1942814350.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfcc = dfcc.append({'country': 'Unspecified', 'iso_code': 'USP'} , ignore_index=True)

In [6]:
print(dfcc.shape)
dfcc.tail()

(218, 2)

               country iso_code
213  Wallis and Futuna      WLF
214              Yemen      YEM
215             Zambia      ZMB
216           Zimbabwe      ZWE
217        Unspecified      USP

In [7]:
# Vemos si hay NaN
dfcc.isnull().sum()

country     0
iso_code    0
dtype: int64

In [8]:
# Veo los tipos de campo
dfcc.dtypes

country     object
iso_code    object
dtype: object

In [9]:
# Genero dfcountry para la Tabla SQL country (CountryDesc, CountryCD)
dfcountry = dfcc
dfcountry = dfcountry.rename(columns={'country': 'CountryDesc', 'iso_code': 'CountryCD'})

In [30]:
print(dfcountry.shape)
dfcountry.head()

(218, 2)

   CountryDesc CountryCD
0  Afghanistan       AFG
1      Albania       ALB
2      Algeria       DZA
3      Andorra       AND
4       Angola       AGO

## Customers 
Se lee el customers.xlsx

In [40]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.10-py2.py3-none-any.whl (242 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 242.1/242.1 kB 172.1 kB/s eta 0:00:00a 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.10

In [41]:
dfcust = pd.read_excel(path +'/customers.xlsx', sheet_name='Sheet1')

In [42]:
print(dfcust.shape)
dfcust.head()

(541909, 4)

   CustomerID             CustomerDesc  CustomerSegmentID         Country
0     17850.0  17850 - Customer #17850                7.0  United Kingdom
1     17850.0  17850 - Customer #17850                7.0  United Kingdom
2     17850.0  17850 - Customer #17850                7.0  United Kingdom
3     17850.0  17850 - Customer #17850                7.0  United Kingdom
4     17850.0  17850 - Customer #17850                7.0  United Kingdom

In [43]:
# Hay muchos duplicados: los borramos
dfcust.drop_duplicates(['CustomerID'], keep='first', inplace=True)

In [44]:
print(dfcust.shape)
dfcust.head()

(4373, 4)

    CustomerID             CustomerDesc  CustomerSegmentID         Country
0      17850.0  17850 - Customer #17850                7.0  United Kingdom
9      13047.0  13047 - Customer #13047                3.0  United Kingdom
26     12583.0  12583 - Customer #12583                2.0          France
46     13748.0  13748 - Customer #13748                3.0  United Kingdom
65     15100.0  15100 - Customer #15100                5.0  United Kingdom

In [45]:
# Vemos si hay NaN
dfcust.isnull().sum()

CustomerID           1
CustomerDesc         0
CustomerSegmentID    1
Country              0
dtype: int64

In [46]:
# Generamos un registro con CustomerID = 0. Allí se asignarán los pedidos sin CustomerID asignado
dfcust = dfcust.fillna(0)
dfcust.isnull().sum()

CustomerID           0
CustomerDesc         0
CustomerSegmentID    0
Country              0
dtype: int64

In [47]:
print(dfcust.shape)
dfcust.head()

(4373, 4)

    CustomerID             CustomerDesc  CustomerSegmentID         Country
0      17850.0  17850 - Customer #17850                7.0  United Kingdom
9      13047.0  13047 - Customer #13047                3.0  United Kingdom
26     12583.0  12583 - Customer #12583                2.0          France
46     13748.0  13748 - Customer #13748                3.0  United Kingdom
65     15100.0  15100 - Customer #15100                5.0  United Kingdom

In [48]:
# Cambio las columnas CustomerID, CustomerSegmentID a entero
dfcust['CustomerID'] = dfcust['CustomerID'].astype(int)
dfcust['CustomerSegmentID'] = dfcust['CustomerSegmentID'].astype(int)

dfcust.dtypes

CustomerID            int64
CustomerDesc         object
CustomerSegmentID     int64
Country              object
dtype: object

In [49]:
by_cust = dfcust.sort_values('CustomerID')
by_cust.head()

        CustomerID             CustomerDesc  CustomerSegmentID         Country
622              0             - Customer #                  0  United Kingdom
61619        12346  12346 - Customer #12346                  2  United Kingdom
14938        12347  12347 - Customer #12347                  2         Iceland
34083        12348  12348 - Customer #12348                  2         Finland
485502       12349  12349 - Customer #12349                  2           Italy

In [50]:
''' Por inconsistencias en los nombres de los países se deben modificar:

customers	country_codes
Country		country	iso_code

Czech Republic >> Czechia CZE
EIRE >> Ireland IRL
RSA >> South Africa ZAF
USA >> United States USA
Channel Islands >> United Kingdom GBR

European Community, Unspecified >> Unspecified USP '''

reemplazos = {'Czech Republic': 'Czechia', 'EIRE': 'Ireland', 'RSA': 'South Africa',
              'USA': 'United States','Channel Islands': 'United Kingdom', 'European Community': 'Unspecified'}

dfcust.replace(reemplazos, inplace=True)

In [51]:
print(dfcust.shape)
dfcust.head()

(4373, 4)

    CustomerID             CustomerDesc  CustomerSegmentID         Country
0        17850  17850 - Customer #17850                  7  United Kingdom
9        13047  13047 - Customer #13047                  3  United Kingdom
26       12583  12583 - Customer #12583                  2          France
46       13748  13748 - Customer #13748                  3  United Kingdom
65       15100  15100 - Customer #15100                  5  United Kingdom

In [52]:
# Hacemos Join con countries para generar la Tabla SQL customer
dfcustomer = pd.merge(dfcust, dfcc, left_on='Country', right_on='country')

In [53]:
print(dfcustomer.shape)
dfcustomer.head()

(4373, 6)

,CustomerID,CustomerDesc,CustomerSegmentID,Country,country,iso_code
0,17850,17850 - Customer #17850,7,United Kingdom,United Kingdom,GBR
1,13047,13047 - Customer #13047,3,United Kingdom,United Kingdom,GBR
2,13748,13748 - Customer #13748,3,United Kingdom,United Kingdom,GBR
3,15100,15100 - Customer #15100,5,United Kingdom,United Kingdom,GBR
4,15291,15291 - Customer #15291,5,United Kingdom,United Kingdom,GBR

In [54]:
# Se borran las columnas Country, country
dfcustomer.drop('Country', axis=1, inplace=True)
dfcustomer.drop('country', axis=1, inplace=True)
dfcustomer = dfcustomer.rename(columns={'iso_code': 'CountryCD'})

In [55]:
print(dfcustomer.shape)
dfcustomer.head()

(4373, 4)

   CustomerID             CustomerDesc  CustomerSegmentID CountryCD
0       17850  17850 - Customer #17850                  7       GBR
1       13047  13047 - Customer #13047                  3       GBR
2       13748  13748 - Customer #13748                  3       GBR
3       15100  15100 - Customer #15100                  5       GBR
4       15291  15291 - Customer #15291                  5       GBR

## Retail 
Se lee el retail.csv

In [57]:
dfret = pd.read_excel(path +'/retail.xlsx', sheet_name='retail')

In [58]:
print(dfret.shape)
dfret.head()

(541909, 8)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [59]:
# Vemos si hay NaN
dfret.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [60]:
# Se borran los 1454 registros sin Description ya que todos tienen UnitPrice 0.
dfret = dfret.dropna(subset =['Description'])

# Se reemplaza con CustomerID = 0 y Description = 'No description' donde no hay info.
dfret = dfret.fillna({'CustomerID': 0})

dfret.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [61]:
# Se borran los 67 registros con Description = ? ya que todos tienen UnitPrice 0 y Quantity negativas.
dfret = dfret[dfret["Description"].str.startswith('?') == False]
print(dfret.shape)
dfret.head()

(540387, 8)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [62]:
# Cambio CustomerID a entero
dfret['CustomerID'] = dfret['CustomerID'].astype(int)

dfret.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID              int64
Country                object
dtype: object

In [63]:
print(dfret.shape)
dfret.head()

(540387, 8)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom

In [83]:
# Generamos el df para la Tabla SQL product (SKU, ProductDesc)
# Borramos los duplicados de StockCode
dfproduct = dfret.copy()
# Pongo las letras con mayúscula porque hay duplicados
dfproduct['StockCode'] = dfproduct['StockCode'].apply(lambda x: x.upper())
# dfproduct['StockCode'] = dfproduct['StockCode'].str.upper()
dfproduct.drop_duplicates(['StockCode'], keep='first', inplace=True)
dfproduct = dfproduct.rename(columns={'StockCode': 'SKU', 'Description': 'ProductDesc'})
dfproduct.drop(columns=['InvoiceNo', 'Quantity', 'InvoiceDate', 'UnitPrice', 'CustomerID', 'Country'], inplace=True)

AttributeError: 'int' object has no attribute 'upper'

In [82]:
print(dfproduct.shape)
dfproduct.head()

(964, 2)

      SKU                          ProductDesc
0  85123A   WHITE HANGING HEART T-LIGHT HOLDER
1     NaN                  WHITE METAL LANTERN
2  84406B       CREAM CUPID HEARTS COAT HANGER
3  84029G  KNITTED UNION FLAG HOT WATER BOTTLE
4  84029E       RED WOOLLY HOTTIE WHITE HEART.

In [70]:
# Hay muchos duplicados: los borramos
dfproduct.drop_duplicates(['SKU'], keep='first', inplace=True)

In [71]:
print(dfproduct.shape)
dfproduct.head()

(3958, 2)

      SKU                          ProductDesc
0  85123A   WHITE HANGING HEART T-LIGHT HOLDER
1   71053                  WHITE METAL LANTERN
2  84406B       CREAM CUPID HEARTS COAT HANGER
3  84029G  KNITTED UNION FLAG HOT WATER BOTTLE
4  84029E       RED WOOLLY HOTTIE WHITE HEART.

In [66]:
# Generamos el df para la Tabla SQL salesdetail (InvoiceNo, StockCode, QuantityAmt, InvoiceDate, InvoiceTime, UnitPriceAmt, CustomerID)
# Se hace un spli con la columna InvoiceDate se parandolo en InvoiceDate e InvoiceTime
dfsales = dfret.copy()

dfsales['Day'] = dfsales['InvoiceDate'].dt.date
dfsales['Time'] = dfsales['InvoiceDate'].dt.time

print(dfsales.shape)
dfsales.head()

(540387, 10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Day,Time
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,2010-12-01,08:26:00
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2010-12-01,08:26:00
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,2010-12-01,08:26:00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2010-12-01,08:26:00
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2010-12-01,08:26:00

In [67]:
#Renombramos columnas y borramos las que no corresponen
dfsales.drop(columns=['Description', 'InvoiceDate', 'Country'], inplace=True)
dfsales = dfsales.rename(columns={'Quantity': 'QuantityAmt', 'UnitPrice': 'UnitPriceAmt', 'Day': 'InvoiceDate', 'Time': 'InvoiceTime'})

In [68]:
print(dfsales.shape)
dfsales.head()

(540387, 7)

,InvoiceNo,StockCode,QuantityAmt,UnitPriceAmt,CustomerID,InvoiceDate,InvoiceTime
0,536365,85123A,6,2.55,17850,2010-12-01,08:26:00
1,536365,71053,6,3.39,17850,2010-12-01,08:26:00
2,536365,84406B,8,2.75,17850,2010-12-01,08:26:00
3,536365,84029G,6,3.39,17850,2010-12-01,08:26:00
4,536365,84029E,6,3.39,17850,2010-12-01,08:26:00

## Guardado tablas en MySQL 
Se guardarán las 4 tablas generadas PRODUCT, COUNTRY, CUSTOMER, SALESDETAIL.
Las tablas ya están creadas en la Base LAB4.

In [21]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 43.8/43.8 kB 209.2 kB/s eta 0:00:00 0:00:01
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [35]:
import pymysql
from sqlalchemy import create_engine

In [36]:
# myConnection = pymysql.connect(host='mysql', user='root', passwd='UADE2021', db='LAB4')

db_data = "mysql+pymysql://root:UADE2021@mysql:3306/LAB4"
engine = create_engine(db_data).connect()

In [38]:
# Se llena la Tabla COUNTRY
dfcountry.to_sql(name='COUNTRY', con=engine, if_exists='append', index=False)

218

In [56]:
# Se llena la Tabla CUSTOMER
dfcustomer.to_sql(name='CUSTOMER', con=engine, if_exists='append', index=False)

4373

In [77]:
dfproduct.to_csv(path + '/SQLProduct.csv')

In [ ]:
# Se llena la Tabla PRODUCT
dfproduct.to_sql(name='PRODUCT', con=engine, if_exists='append', index=False, chunksize=500)

In [ ]:
# Se llena la Tabla SALESDETAIL
dfsales.to_sql(name='SALESDETAIL', con=engine, if_exists='append', index=False)